experiments/results/logs/aa-burst-hpaB-001/wrk2.txt
Running 2m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 7034.060ms, rate sampling interval: 16523ms
  Thread calibration: mean lat.: 7038.484ms, rate sampling interval: 17481ms
  Thread calibration: mean lat.: 6962.298ms, rate sampling interval: 16465ms
  Thread calibration: mean lat.: 6998.507ms, rate sampling interval: 16515ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.96m    27.09s    1.75m    57.17%
    Req/Sec     3.12      0.33     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.96m 
 75.000%    1.33m 
 90.000%    1.59m 
 99.000%    1.72m 
 99.900%    1.73m 
 99.990%    1.75m 
 99.999%    1.75m 
100.000%    1.75m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10223.615     0.000000            1         1.00
   21315.583     0.100000          163         1.11
   29736.959     0.200000          326         1.25
   39256.063     0.300000          487         1.43
   49283.071     0.400000          648         1.67
   57737.215     0.500000          809         2.00
   62619.647     0.550000          890         2.22
   67043.327     0.600000          971         2.50
   71499.775     0.650000         1052         2.86
   75759.615     0.700000         1133         3.33
   79757.311     0.750000         1214         4.00
   82575.359     0.775000         1254         4.44
   85983.231     0.800000         1296         5.00
   87621.631     0.825000         1336         5.71
   91488.255     0.850000         1377         6.67
   93782.015     0.875000         1417         8.00
   94437.375     0.887500         1437         8.89
   95879.167     0.900000         1457        10.00
   97452.031     0.912500         1477        11.43
   98959.359     0.925000         1498        13.33
   99614.719     0.937500         1517        16.00
  100007.935     0.943750         1527        17.78
  100335.615     0.950000         1538        20.00
  100532.223     0.956250         1548        22.86
  101187.583     0.962500         1559        26.67
  101515.263     0.968750         1568        32.00
  101711.871     0.971875         1574        35.56
  101842.943     0.975000         1579        40.00
  102236.159     0.978125         1583        45.71
  102432.767     0.981250         1589        53.33
  102825.983     0.984375         1594        64.00
  103022.591     0.985938         1596        71.11
  103153.663     0.987500         1598        80.00
  103415.807     0.989062         1601        91.43
  103481.343     0.990625         1604       106.67
  103809.023     0.992188         1611       128.00
  103809.023     0.992969         1611       142.22
  103809.023     0.993750         1611       160.00
  103809.023     0.994531         1611       182.86
  103809.023     0.995313         1611       213.33
  103874.559     0.996094         1613       256.00
  103874.559     0.996484         1613       284.44
  103874.559     0.996875         1613       320.00
  103940.095     0.997266         1615       365.71
  103940.095     0.997656         1615       426.67
  103940.095     0.998047         1615       512.00
  104005.631     0.998242         1616       568.89
  104005.631     0.998437         1616       640.00
  104005.631     0.998633         1616       731.43
  104464.383     0.998828         1617       853.33
  104464.383     0.999023         1617      1024.00
  104464.383     0.999121         1617      1137.78
  104464.383     0.999219         1617      1280.00
  104464.383     0.999316         1617      1462.86
  104923.135     0.999414         1618      1706.67
  104923.135     1.000000         1618          inf
#[Mean    =    57694.484, StdDeviation   =    27090.588]
#[Max     =   104857.600, Total count    =         1618]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1721 requests in 2.00m, 17.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 4241
Requests/sec:     14.32
Transfer/sec:    150.84KB